Revit 2027 API
FailureMessageKey.Equality Operator
Determines whether two FailureMessageKeys are the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator ==(
	FailureMessageKey first,
	FailureMessageKey second
)
Public Shared Operator = (
	first As FailureMessageKey,
	second As FailureMessageKey
) As Boolean
public:
static bool operator ==(
	FailureMessageKey^ first,
	FailureMessageKey^ second
)
static let inline (=)
        first : FailureMessageKey *
        second : FailureMessageKey  : bool
Parameters
first FailureMessageKey
The first FailureMessageKey.
second FailureMessageKey
The second FailureMessageKey.
Return Value
Boolean
True if the FailureMessageKeys are the same; otherwise, false.
See Also
Reference
FailureMessageKey Class
Autodesk.Revit.DB Namespace